Revit 2027 API
FabricationPart.GetPartCustomDataReal Method
 Get custom data real value for the specified custom data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetPartCustomDataReal(
	int customId
)
Public Function GetPartCustomDataReal (
	customId As Integer
) As Double
public:
double GetPartCustomDataReal(
	int customId
)
member GetPartCustomDataReal :
        customId : int -> float
Parameters
customId Int32
 The identifier of the custom data field to get.
Return Value
Double
 Returns the real number of the custom data. If the data is not a number it will return 0.0.
Exceptions
Exception | Condition
ArgumentException |  The custom data does not exist on the part.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace